

/*
একটি টেক্সট ফাইল তৈরি করও, যেখানে রোল নম্বর (একটি রোল নম্বরের প্রাপ্ত একটি বিষয়ের পরীক্ষার নম্বর। একরম দশজন শিক্ষার্থীর জন্য দশটি লাইন তৈরি কর। ধরা যাক, এটি গণিত পরীক্ষার ফল, তাই ফাইলটি math.txt নামে সেভ কর। এবারে ওই দশজন শিক্ষার্থীর বাংলা ও ইংরেজি পরীক্ষার ফলের জন্যও অনুরূপ ফাইল তৈরি কর এবং সেগুলোকে যথাক্রমে bangla.txt ও english.txt নাম দিয়ে সেভ কর। এখন তুমি একটি প্রোগ্রাম তৈরি করবে, যেটি ওই তিনটি ফাইল থেকে পরীক্ষার রেজাল্ট পড়ে প্রতিটি শিক্ষার্থীর গড় নম্বর বের করে আরেকটি ফাইলে সেভ করবে। আর এই ফাইলেও প্রথমে রোল নম্বর, তারপরে একটি স্পেস, তারপরে গড় নম্বর থাকবে। তোমাদের সবারই এই প্রোগ্রামটি লিখতে পারা উচিত। কেউ ৩০ মিনিটে করবে, কারও তিন ঘণ্টা লাগবে, কারও বা তিন দিন। কত সময় লাগল, সেটি এখন কোনো ব্যাপার নয়, নিজে নিজে প্রোগ্রামটি লিখতে পারাটাই গুরুত্বপূর্ণ।
*/